Table of Contents
 Class CheckResSummary
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Check summary
[Serializable]
[DataContract]
public class CheckResSummary
Inheritance
object
CheckResSummary
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CheckStatus
Status of check
[DataMember]
public bool CheckStatus { get; set; }
Property Value
bool
 CheckValue
Check value
[DataMember]
public double CheckValue { get; set; }
Property Value
double
 LoadCaseId
Id of Load Case
[Obsolete]
[DataMember]
public int LoadCaseId { get; set; }
Property Value
int
 Name
Name
[DataMember]
public string Name { get; set; }
Property Value
string
 Skipped
Whether the check was calculated or not. If true, the check was not calculated and CheckValue should be ignored, otherwise false.
[DataMember]
public bool Skipped { get; set; }
Property Value
bool
 UnityCheckMessage
Detail message about overall check
[DataMember]
public string UnityCheckMessage { get; set; }
Property Value
string
 Edit this page